mafeiGitHub/stm32Mp3/src/main.cpp
// main.cpp
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdint.h>
#include <math.h>

#include "cmsis_os.h"

#include "stm32f7xx_hal.h"
#include "stm32f7xx_hal_sai.h"

#include "../Bsp/stm32746g_discovery_audio.h"
#include "../Bsp/stm32746g_discovery.h"
#include "../Bsp/stm32746g_discovery_ts.h"
#include "../Bsp/stm32746g_discovery_lcd.h"
#include "../Bsp/ethernetif.h"

#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "ipv4/lwip/ip_addr.h"
#include "lwip/api.h"

#include "../fatfs/ff.h"
#include "../fatfs/ff_gen_drv.h"
#include "../fatfs/drivers/sd_diskio.h"

#include "../sys/cpuUsage.h"
#include "../httpServer/httpServer.h"

#include <string>
#include <sstream>
#include <iostream>
#include <iomanip>

//#include "cMp3decoder.h"
//}}}
//{{{  ip defines
// static IP address
#define IP_ADDR0  192
#define IP_ADDR1  168
#define IP_ADDR2  1
#define IP_ADDR3  67

// netmask
#define NETMASK_ADDR0  255
#define NETMASK_ADDR1  255
#define NETMASK_ADDR2  255
#define NETMASK_ADDR3   0

// gateway address
#define GW_ADDR0  192
#define GW_ADDR1  168
#define GW_ADDR2  0
#define GW_ADDR3  1

// dhcp defines
#define DHCP_START             (uint8_t)1
#define DHCP_WAIT_ADDRESS      (uint8_t)2
#define DHCP_ADDRESS_ASSIGNED  (uint8_t)3
#define DHCP_TIMEOUT           (uint8_t)4
#define DHCP_LINK_DOWN         (uint8_t)5
//}}}
//{{{  sdram allocation
#define SDRAM_FRAME0   0xC0000000 // frameBuffer 272*480*4 = 0x7f800 = 512k-2048b leave bit of guard for clipping errors
#define SDRAM_FRAME1   0xC0080000
#define SDRAM_HEAP     0xC0100000 // sdram heap
#define SDRAM_HEAP_SIZE  0x700000 // 7m
//}}}

//{{{
static std::string toString (int value) {

  std::ostringstream os;
  os << value;
  return os.str();
  }
//}}}
//{{{
class cLcd {
public:
  //{{{
  cLcd()  {
    mStartTime = osKernelSysTick();
    updateNumDrawLines();
    }
  //}}}
  ~cLcd() {}

  //{{{
  void init (uint32_t buffer0, uint32_t buffer1) {

    mBuffer[0] = buffer0;
    mBuffer[1] = buffer1;

    lcdInit (mBuffer[0]);
    lcdClear (LCD_BLACK);
    lcdSendWait();
    lcdDisplayOn();
    }
  //}}}

  //{{{
  int getWidth() {
    return lcdGetXSize();
    }
  //}}}
  //{{{
  int getHeight() {
    return lcdGetYSize();
    }
  //}}}
  //{{{
  void setShowTime (bool enable) {
    mShowTime = enable;
    }
  //}}}
  //{{{
  void setDebug (bool enable) {
    mDebug = enable;
    updateNumDrawLines();
    }
  //}}}
  //{{{
  void setTitle (std::string title) {
    mTitle = title;
    updateNumDrawLines();
    }
  //}}}
  //{{{
  void setFooter (std::string footer) {
    mFooter = footer;
    updateNumDrawLines();
    }
  //}}}
  //{{{
  void line (int colour, std::string str) {

    bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

    auto line = (mLastLine < mMaxLine-1) ? mLastLine+1 : mLastLine;
    mLines[line].mTime = osKernelSysTick();
    mLines[line].mColour = colour;
    mLines[line].mString = str;
    mLastLine = line;

    if (tailing)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    }
  //}}}
  //{{{
  void line (std::string str) {
    line (LCD_WHITE, str);
    }
  //}}}
  //{{{
  void reset() {

    for (auto i = 0; i < mMaxLine; i++)
      mLines[i].reset();

    mStartTime = osKernelSysTick();
    mLastLine = -1;
    mFirstLine = 0;
    }
  //}}}

  //{{{
  void displayTop() {
    mFirstLine = 0;
    }
  //}}}
  //{{{
  void displayTail() {

    if (mLastLine > (int)mNumDrawLines-1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = 0;
    }
  //}}}

  //{{{
  void pressed (int pressCount, int x, int y, int xinc, int yinc) {

    if ((pressCount > 30) && (x <= mStringPos) && (y <= mLineInc))
      reset();
    else if (pressCount == 0) {
      if (x <= mStringPos) {
        // set displayFirstLine
        if (y < 2 * mLineInc)
          displayTop();
        else if (y > lcdGetYSize() - 2 * mLineInc)
          displayTail();
        }
      }
    else {
      // inc firstLine
      float value = mFirstLine - (yinc / 4.0f);

      if (value < 0)
        mFirstLine = 0;
      else if (mLastLine <= (int)mNumDrawLines-1)
        mFirstLine = 0;
      else if (value > mLastLine - mNumDrawLines + 1)
        mFirstLine = mLastLine - mNumDrawLines + 1;
      else
        mFirstLine = value;
      }
    }
  //}}}

  //{{{
  void draw() {

    auto y = 0;
    if (!mTitle.empty()) {
      // draw title
      lcdString (LCD_WHITE, mFontHeight, mTitle, 0, y, lcdGetXSize(), mLineInc);
      y += mLineInc;
      }

    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = mLineInc + ((int)mFirstLine * mNumDrawLines * mLineInc / (mLastLine + 1));
      auto ylen = mNumDrawLines * mNumDrawLines * mLineInc / (mLastLine + 1);
      lcdRectClipped (LCD_YELLOW, 0, yorg, 8, ylen);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      // draw line
      auto x = 0;
      if (mShowTime) {
        lcdString (LCD_GREEN, mFontHeight,
                   toString ((mLines[lineIndex].mTime-mStartTime)/1000) + "." +
                   toString ((mLines[lineIndex].mTime-mStartTime) % 1000), x, y, lcdGetXSize(), mLineInc);
        x += mStringPos;
        }
      lcdString (mLines[lineIndex].mColour, mFontHeight, mLines[lineIndex].mString, x, y, lcdGetXSize(), mLineInc);
      y += mLineInc;
      }

    if (mDebug)
      // draw lcdDebug
      lcdDebug (lcdGetYSize() - 2 * mLineInc);

    if (!mFooter.empty())
      // draw footer
      lcdString (LCD_YELLOW, mFontHeight, mFooter, 0, lcdGetYSize()-mLineInc, lcdGetXSize(), mLineInc);
    }
  //}}}

private:
  //{{{
  void updateNumDrawLines() {

    auto numDrawLines = lcdGetYSize() / mLineInc;

    if (!mTitle.empty())
      numDrawLines--;

    if (mDebug)
      numDrawLines--;

    if (!mFooter.empty())
      numDrawLines--;

    mNumDrawLines = numDrawLines;
    mStringPos = mLineInc*3;
    }
  //}}}

  int mStartTime = 0;

  float mFirstLine = 0;
  int mNumDrawLines = 0;
  int mFontHeight = 16;
  int mLineInc = 18;
  int mStringPos = 0;

  bool mShowTime = true;
  bool mDebug = false;

  std::string mTitle;
  std::string mFooter;

  int mLastLine = -1;
  int mMaxLine = 500;

  //{{{
  class cLine {
  public:
    cLine() {}
    ~cLine() {}

    //{{{
    void reset() {
      mTime = 0;
      mColour = LCD_WHITE;
      mString = "";
      }
    //}}}

    int mTime = 0;
    int mColour = LCD_WHITE;
    std::string mString;
    };
  //}}}
  cLine mLines[500];

  uint32_t mBuffer [2] = {0,0};
  };
//}}}
//{{{  vars
static struct netif gNetif;
static volatile uint8_t DHCP_state = DHCP_START;

static osSemaphoreId dhcpSem;
static osSemaphoreId audioSem;
static osSemaphoreId loadedSem;

static cLcd mLcd;
static float mVolume = 0.8f;
//}}}

//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {
  osSemaphoreRelease (audioSem);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {
  osSemaphoreRelease (audioSem);
  }
//}}}

// threads
//{{{
static void uiThread (void const* argument) {

  const int kInfo = 150;
  const int kVolume = 440;

  mLcd.line ("UIThread started");
  BSP_TS_Init (mLcd.getWidth(), mLcd.getHeight());

  int pressed [5] = {0, 0, 0, 0, 0};
  int lastx [5];
  int lasty [5];
  uint32_t frameBufferAddress = SDRAM_FRAME0;

  //  init touch
  uint32_t took = 0;
  while (true) {
    TS_StateTypeDef tsState;
    BSP_TS_GetState (&tsState);

    frameBufferAddress = (frameBufferAddress == SDRAM_FRAME0) ? SDRAM_FRAME1 : SDRAM_FRAME0;
    lcdSetLayer (0, frameBufferAddress);
    lcdFrameSync();
    auto time = osKernelSysTick();
    lcdClear (LCD_BLACK);

    //  touchscreen
    for (auto touch = 0; touch < 5; touch++) {
      if ((touch < tsState.touchDetected) && tsState.touchWeight[touch]) {
        auto x = tsState.touchX[touch];
        auto y = tsState.touchY[touch];
        lcdEllipse (touch > 0 ? LCD_LIGHTGREY : x < kInfo ? LCD_GREEN : x < kVolume ? LCD_MAGENTA : LCD_YELLOW,
                    x, y, tsState.touchWeight[touch], tsState.touchWeight[touch]);
        if (touch == 0) {
          if (x < kInfo)
            mLcd.pressed (pressed[touch], x, y, pressed[touch] ? x - lastx[touch] : 0, pressed[touch] ? y - lasty[touch] : 0);
          else if (x < kVolume)
            mLcd.line (toString(x) + "," + toString (y) + "," + toString (tsState.touchWeight[touch]));
          else {
            //{{{  adjust volume
            auto volume = pressed[touch] ? mVolume + float(y - lasty[touch]) / mLcd.getHeight(): float(y) / mLcd.getHeight();

            if (volume < 0)
              volume = 0;
            else if (volume > 1.0f)
              volume = 1.0f;

            if (volume != mVolume) {
              mLcd.line ("vol " + toString(int(volume*100)) + "%");
              mVolume = volume;
              }
            }
            //}}}
          }
        lastx[touch] = x;
        lasty[touch] = y;
        pressed[touch]++;
        }
      else
        pressed[touch] = 0;
      }
    //{{{  volume bar
    lcdRect (LCD_YELLOW, mLcd.getWidth()-20, 0, 20, int(mVolume * mLcd.getHeight()));
    //}}}
    //{{{  waveform
    //int frames = 0;
    //uint8_t* power = nullptr;
    //int frame = 0 - lcdGetXSize()/2;
    //for (auto x = 0; x < lcdGetXSize(); x++, frame++) {
      //if (frames <= 0)
        //power = nullptr;
      //if (power) {
        //uint8_t top = *power++;
        //uint8_t ylen = *power++;
        //lcdRect (LCD_BLUE, x, top, 1, ylen);
        //frames--;
        //}
      //}
    //}}}

    mLcd.setFooter (toString (xPortGetFreeHeapSize()) + " " + toString (osGetCPUUsage()) + "% " + toString (took) + "ms");
    mLcd.draw();
    lcdSendWait();
    lcdShowLayer (0, frameBufferAddress, 255);

    took = osKernelSysTick() - time;
    }
  }
//}}}
//{{{
static void loadThread (void const* argument) {

  mLcd.line ("loadThread started");
  BSP_SD_Init();
  while (BSP_SD_IsDetected() != SD_PRESENT) {
    mLcd.line (LCD_RED, "no SD card");
    osDelay (1000);
    }
  mLcd.line ("SD card found");

  char SD_Path[4];
  if (FATFS_LinkDriver (&SD_Driver, SD_Path) != 0)
    mLcd.line (LCD_RED, "SD driver error");
  else {
    mLcd.line ("SD driver found");

    FATFS fatFs;
    f_mount (&fatFs, "", 0);
    mLcd.line ("FAT fileSystem mounted");

    DIR dir;
    if (f_opendir (&dir, "/") != FR_OK)
      mLcd.line (LCD_RED, "directory open error");
    else {
      mLcd.line ("directory opened");

      FILINFO filInfo;
      filInfo.lfname = (char*)malloc (_MAX_LFN + 1);
      filInfo.lfsize = _MAX_LFN + 1;
      auto extension = "MP3";
      while (true) {
        if ((f_readdir (&dir, &filInfo) != FR_OK) || filInfo.fname[0] == 0)
          break;
        if (filInfo.fname[0] == '.')
          continue;
        if (!(filInfo.fattrib & AM_DIR)) {
          auto i = 0;
          while (filInfo.fname[i++] != '.') {;}
          if ((filInfo.fname[i] == extension[0]) &&
              (filInfo.fname[i+1] == extension[1]) &&
              (filInfo.fname[i+2] == extension[2])) {
            mLcd.line (filInfo.lfname[0] ? (char*)filInfo.lfname : (char*)&filInfo.fname);
            }
          }
        }
      }
    }

  int tick = 0;
  while (true) {
    osDelay (5000);
    mLcd.line ("load tick" + toString (tick++));
    //osSemaphoreWait (loadedSem, osWaitForever);
    }
  }
//}}}
//{{{
static void playThread (void const* argument) {

  mLcd.line ("playThread started");

  int curVol = 80;
  BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_BOTH, curVol, 48000);
  BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);

  bool audioBufferFull = false;
  int16_t* audioBuf = (int16_t*)malloc (8192);
  memset (audioBuf, 0, 8192);
  BSP_AUDIO_OUT_Play ((uint16_t*)audioBuf, 8192);

  mLcd.line ("playThread loop");
  while (true) {
    if (osSemaphoreWait (audioSem, 50) == osOK) {
      //int16_t* audioPtr = audioBuf + (audioBufferFull * 2048);
      //int16_t* audioSamples = hlsRadio->getAudioSamples (hlsRadio->mPlayFrame, seqNum);
      //if (hlsRadio->mPlaying && audioSamples) {
      //  memcpy (audioPtr, audioSamples, 4096);
      //  hlsRadio->mPlayFrame++;
      //  }
      //else
      //  memset (audioPtr, 0, 4096);
      audioBufferFull = !audioBufferFull;
      }
    }
  }
//}}}
//{{{
static void dhcpThread (void const* argument) {

  mLcd.line ("dhcpThread started");
  auto netif = (struct netif*)argument;

  struct ip_addr ipAddrInit;
  IP4_ADDR (&ipAddrInit, 0, 0, 0, 0);

  while (true) {
    switch (DHCP_state) {
      case DHCP_START:
        netif->ip_addr = ipAddrInit;
        netif->netmask = ipAddrInit;
        netif->gw = ipAddrInit;
        dhcp_start (netif);
        DHCP_state = DHCP_WAIT_ADDRESS;
        break;

      case DHCP_WAIT_ADDRESS:
        if (netif->ip_addr.addr) {
          dhcp_stop (netif);
          DHCP_state = DHCP_ADDRESS_ASSIGNED;
          osSemaphoreRelease (dhcpSem);
          }
        else if (netif->dhcp->tries > 4) {
          //  DHCP timeout
          DHCP_state = DHCP_TIMEOUT;
          dhcp_stop (netif);

          // use static address
          struct ip_addr ipAddr;
          IP4_ADDR (&ipAddr, IP_ADDR0 ,IP_ADDR1 , IP_ADDR2 , IP_ADDR3 );
          struct ip_addr netmask;
          IP4_ADDR (&netmask, NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
          struct ip_addr gateway;
          IP4_ADDR (&gateway, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
          netif_set_addr (netif, &ipAddr , &netmask, &gateway);
          osSemaphoreRelease (dhcpSem);
          }
        break;

      default:
        break;
      }

    osDelay (250); // ms
    }

  osThreadTerminate (NULL);
  }
//}}}
//{{{
static void startThread (void const* argument) {

  mLcd.init (SDRAM_FRAME0, SDRAM_FRAME1);
  mLcd.setTitle (__TIME__ __DATE__);
  mLcd.line ("startThread started");

  const osThreadDef_t osThreadUi = { (char*)"UI", uiThread, osPriorityNormal, 0, 2000 };
  osThreadCreate (&osThreadUi, NULL);
  const osThreadDef_t osThreadLoad =  { (char*)"Load", loadThread, osPriorityNormal, 0, 8000 };
  osThreadCreate (&osThreadLoad, NULL);
  const osThreadDef_t osThreadPlay =  { (char*)"Play", playThread, osPriorityAboveNormal, 0, 2000 };
  osThreadCreate (&osThreadPlay, NULL);

  tcpip_init (NULL, NULL);
  mLcd.line ("tcpip_init ok");

  // init LwIP stack
  struct ip_addr ipAddr;
  IP4_ADDR (&ipAddr, IP_ADDR0, IP_ADDR1, IP_ADDR2, IP_ADDR3);
  struct ip_addr netmask;
  IP4_ADDR (&netmask, NETMASK_ADDR0, NETMASK_ADDR1 , NETMASK_ADDR2, NETMASK_ADDR3);
  struct ip_addr gateway;
  IP4_ADDR (&gateway, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
  netif_add (&gNetif, &ipAddr, &netmask, &gateway, NULL, &ethernetif_init, &tcpip_input);
  netif_set_default (&gNetif);

  if (netif_is_link_up (&gNetif)) {
    netif_set_up (&gNetif);
    mLcd.line ("ethernet connected");

    DHCP_state = DHCP_START;
    const osThreadDef_t osThreadDHCP =  { (char*)"DHCP", dhcpThread, osPriorityBelowNormal, 0, 256 };
    osThreadCreate (&osThreadDHCP, &gNetif);

    while (osSemaphoreWait (dhcpSem, 1000) == osOK)
      osDelay (1000);

    mLcd.line ("dhcp address allocated");
    httpServerInit();
    mLcd.line ("httpServer started");
    }
  else {
    //{{{  no ethernet
    netif_set_down (&gNetif);
    DHCP_state = DHCP_LINK_DOWN;
    mLcd.line (LCD_RED, "no ethernet");
    }
    //}}}

  for (;;)
    osThreadTerminate (NULL);
  }
//}}}

// init
//{{{
static void MPUconfigSRAM() {
// config MPU attributes as WriteThrough for SRAM
// base Address is 0x20010000 since this memory interface is the AXI.
// region Size is 256KB, it is related to SRAM1 and SRAM2 memory size

  HAL_MPU_Disable();

  MPU_Region_InitTypeDef MPU_InitStruct;
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x20010000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  HAL_MPU_ConfigRegion (&MPU_InitStruct);

  HAL_MPU_Enable (MPU_PRIVILEGED_DEFAULT);
  }
//}}}
//{{{
static void MPUconfigSDRAM() {
// Configure the MPU attributes as writeThrough for SDRAM

  HAL_MPU_Disable();

  MPU_Region_InitTypeDef MPU_InitStruct;
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0xC0000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_8MB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  HAL_MPU_ConfigRegion (&MPU_InitStruct);

  HAL_MPU_Enable (MPU_PRIVILEGED_DEFAULT);
  }
//}}}
//{{{
static void initSystemClock216() {
//  System Clock source            = PLL (HSE)
//  SYSCLK(Hz)                     = 216000000
//  HCLK(Hz)                       = 216000000
//  HSE Frequency(Hz)              = 25000000
//  PLL_M                          = 25
//  PLL_N                          = 432
//  PLL_P                          = 2
//  PLL_Q                          = 9
//  VDD(V)                         = 3.3
//  Main regulator output voltage  = Scale1 mode
//  AHB Prescaler                  = 1
//  APB1 Prescaler                 = 4
//  APB2 Prescaler                 = 2
//  Flash Latency(WS)              = 7

  // Enable HSE Oscillator and activate PLL with HSE as source
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig (&RCC_OscInitStruct) != HAL_OK)
    while (true) {;}

  // Activate the OverDrive to reach the 216 MHz Frequency
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
    while (true) {;}

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig (&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
    while (true) {;}
  }
//}}}
//{{{
int main() {

  // init cpu caches, clocks, memory regions
  SCB_EnableICache();
  SCB_EnableDCache();
  HAL_Init();

  MPUconfigSRAM();
  MPUconfigSDRAM();
  initSystemClock216();

  // init heap
  HeapRegion_t xHeapRegions[] = { {(uint8_t*)SDRAM_HEAP, SDRAM_HEAP_SIZE }, { NULL, 0 } };
  vPortDefineHeapRegions (xHeapRegions);

  // init semaphores
  osSemaphoreDef (dhcp);
  dhcpSem = osSemaphoreCreate (osSemaphore (dhcp), -1);
  osSemaphoreDef (Loaded);
  loadedSem = osSemaphoreCreate (osSemaphore (Loaded), -1);
  osSemaphoreDef (aud);
  audioSem = osSemaphoreCreate (osSemaphore (aud), -1);

  const osThreadDef_t osThreadStart = { (char*)"Start", startThread, osPriorityNormal, 0, 4000 };
  osThreadCreate (&osThreadStart, NULL);

  osKernelStart();
  return 0;
  }
//}}}
